src/apersci/output/templates/request-getBins.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v4="http://v4.core.coexprivate.api.shopatron.com">
   <soapenv:Header/>
   <soapenv:Body>
      <v4:getBins>
         <v4:request>
             <v4:FulfillerID>{{.FulfillerID}}</v4:FulfillerID>
             <v4:ExternalLocationID>{{.ExternalLocationID}}</v4:ExternalLocationID>
             <v4:SearchTerm>{{.SearchTerm}}</v4:SearchTerm>
             <v4:NumResults>{{.NumResults}}</v4:NumResults>
             <v4:ResultsStart>{{.ResultsStart}}</v4:ResultsStart>
         </v4:request>
      </v4:getBins>
   </soapenv:Body>
</soapenv:Envelope>
